docs/documentation/library/index.org
#+html_head: <link rel="stylesheet" href="../../modulus-style.css" type="text/css"/>
#+title: Modulus Standard Library
#+options: toc:nil num:nil html-postamble:nil

#+html: <div style="text-align:right">
[[file:../../index.org][Modulus]] / [[file:../index.org][Documentation]] / Library
#+html: </div>

* Standard Library
Most standard libraries 


+ Prelude

+ [[file:abs/index.org][Abstractions]] (=abs=)
  + [[file:abs/data/index.org][Data Structures]] (=data=)
    + [[file:abs/data/functor.org][Functor]]
    + [[file:abs/data/applicative.org][Applicative]]
    + [[file:abs/data/monad.org][Monad]]
    + [[file:abs/data/foldable.org][Foldable]]
    + [[file:abs/data/traversable.org][Traversable]]
  + Category / =cat=
    + Isomorphism / =iso=
    + Product / =iso= (lens)
    + Sum / =iso= (prism)
  + Orderings / =ord=
    + Partial
    + Total
    + Lattice
  + Groups / =group=
    + Magma / =magma=
    + Semigroup / =semigroup=
    + Monoid / =monoid=
    + Group / =group=
  + Numerics / =num=
    + Ring / =ring=
    + Field / =field=

+ Numerics / =num=
  + Unit / =unit=
  + Bool / =bool=
  + Integer / =int=
  + Rational / =rational=
  + Real / =real=
  + Complex / =complex=
  + Unsigned / =uint=
  + Signed / =sint=
  + Word / =word=

+ Data Structures / =data=
  + [[file:data/array.org][Array]] / =array=
  + [[file:data/list.org][List]] / =list=
  + Vector / =vector=
  + Tensor / =tensor=

+ Monad / =monad=
  + IO / =io=
  + State / =state=
  + Except / =except=
  + Reader / =reader=
  + Writer / =writer=
    # Software transactional Memory
  + STM / =stm=

# TODO: linear types?
# getting resources via sockets
+ System (=sys=)
  + Socket (=socket=)
  + Console (=console=)

# Optics???
# + Optics
#   + Isomorphism / =iso= 
#   + Lens  / =lens=
#   + Prism / =prism=
#   + Fold  / =trav=
#   + Traversal / =trav=
