docs/documentation/library/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-28 Mon 09:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Modulus Standard Library</title>
<meta name="author" content="Connor Redfern" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../../modulus-style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Modulus Standard Library</h1>
<div style="text-align:right">
<p>
<a href="../../index.html">Modulus</a> / <a href="../index.html">Documentation</a> / Library
</p>
</div>

<div id="outline-container-org8156ae1" class="outline-2">
<h2 id="org8156ae1">Standard Library</h2>
<div class="outline-text-2" id="text-org8156ae1">
<p>
Most standard libraries 
</p>


<ul class="org-ul">
<li>Prelude</li>

<li><a href="abs/index.html">Abstractions</a> (<code>abs</code>)
<ul class="org-ul">
<li><a href="abs/data/index.html">Data Structures</a> (<code>data</code>)
<ul class="org-ul">
<li><a href="abs/data/functor.html">Functor</a></li>
<li><a href="abs/data/applicative.html">Applicative</a></li>
<li><a href="abs/data/monad.html">Monad</a></li>
<li><a href="abs/data/foldable.html">Foldable</a></li>
<li><a href="abs/data/traversable.html">Traversable</a></li>
</ul></li>
<li>Category / <code>cat</code>
<ul class="org-ul">
<li>Isomorphism / <code>iso</code></li>
<li>Product / <code>iso</code> (lens)</li>
<li>Sum / <code>iso</code> (prism)</li>
</ul></li>
<li>Orderings / <code>ord</code>
<ul class="org-ul">
<li>Partial</li>
<li>Total</li>
<li>Lattice</li>
</ul></li>
<li>Groups / <code>group</code>
<ul class="org-ul">
<li>Magma / <code>magma</code></li>
<li>Semigroup / <code>semigroup</code></li>
<li>Monoid / <code>monoid</code></li>
<li>Group / <code>group</code></li>
</ul></li>
<li>Numerics / <code>num</code>
<ul class="org-ul">
<li>Ring / <code>ring</code></li>
<li>Field / <code>field</code></li>
</ul></li>
</ul></li>

<li>Numerics / <code>num</code>
<ul class="org-ul">
<li>Unit / <code>unit</code></li>
<li>Bool / <code>bool</code></li>
<li>Integer / <code>int</code></li>
<li>Rational / <code>rational</code></li>
<li>Real / <code>real</code></li>
<li>Complex / <code>complex</code></li>
<li>Unsigned / <code>uint</code></li>
<li>Signed / <code>sint</code></li>
<li>Word / <code>word</code></li>
</ul></li>

<li>Data Structures / <code>data</code>
<ul class="org-ul">
<li><a href="data/array.html">Array</a> / <code>array</code></li>
<li><a href="data/list.html">List</a> / <code>list</code></li>
<li>Vector / <code>vector</code></li>
<li>Tensor / <code>tensor</code></li>
</ul></li>

<li>Monad / <code>monad</code>
<ul class="org-ul">
<li>IO / <code>io</code></li>
<li>State / <code>state</code></li>
<li>Except / <code>except</code></li>
<li>Reader / <code>reader</code></li>
<li>Writer / <code>writer</code></li>
<li>STM / <code>stm</code></li>
</ul></li>
</ul>

<ul class="org-ul">
<li>System (<code>sys</code>)
<ul class="org-ul">
<li>Socket (<code>socket</code>)</li>
<li>Console (<code>console</code>)</li>
</ul></li>
</ul>
</div>
</div>
</div>
</body>
</html>
